HEADER_TITLE = "Оглавление";
TITLES = ["Делиться", "Бояться темноты", "Играйте осторожно"];
PAGE_NUMBERS = [
  [1,2,3,4,5,6,7,8,9],
  [1,2,3,4,5,6,8,9,10,11,12],
  [1,2,3,4,5,6,7,8,9,10,11]
];

BUTTONS = {"help" : "Справка", "main_menu" : "Главное меню", "story_book" : "Оглавление",
  "read_myself" : "Читать", "read_to_me" : "Слушать", "story_menu" : "Меню рассказа"};

TEXTS = [
  [
    [
      {text:"Знаете ли вы, почему нужно делиться?", time:3.2},

      {text:"Носок и его лучшие друзья Ботинки", time:6.4},
      {text:"расскажут вам об этом.", time:8.8}
    ],
    [
      {text:"Однажды Носок и Ботинки пошли поиграть.", time:13.6},
      {text:"Собрали обеды, и вышли гулять.", time:16.9},
      {text:"Носок говорит: «В парке играть веселее».", time:21.4},
      {text:"Ботинки ответили:", time:23.4},
      {text:"«Давай играть, пока не стемнеет».", time:26.9}
    ],

    [
      {text:"Как только они в парк пришли,", time:29.6},
      {text:"Достали обеды и играть пошли.", time:34.2},
      {text:"Носок говорит: «Давай развлекаться!", time:37.4},
      {text:"Бегать, в прятки играть и смеяться».", time:42}

    ],
    [
      {text:"Птицы прилетели, на обед Носка сели,", time:46.4},
      {text:"Жевали-жевали, ели и ели.", time:51.3},
      {text:"Носок и Ботинки захотят пообедать.", time:55.2},
      {text:"Но что без обеда Носок будет делать?", time:59.7}
    ],
    [
      {text:"Ботинки предложили: «Давай поедим,", time:64.2},
      {text:"Вкусным обедом голод свой утолим».", time:68.3},
      {text:"Они до полудня вместе играли.", time:60+11.2},
      {text:"А птицы весь обед Носка склевали.", time:60+15.5}
    ],
    [

      {text:"«О, нет!» - голодный Носок закричал.", time:60+20},
      {text:"«Остался я без обеда» - и он заплакал.", time:60+25.3},
      {text:"«Не волнуйся»,- Ботинки ему сказали,", time:60+29.5},
      {text:"И половину своего обеда Носку отдали.", time:60+35}

    ],
    [

      {text:"Носок обрадовался", time:60+36.5},
      {text:"тому что он не останется голодным.", time:60+39.4},
      {text:"Ботинки с ним поделились", time:60+40.6},
      {text:"даже своим любимым Шоколадным тортом.", time:60+44.4},
      {text:"Ботинки улыбались, и они поняли одно -", time:60+49},
      {text:"Делиться – это очень хорошо!", time:60+53}
    ],
    [
      {text:"Теперь вы понимаете", time:60+54.8},
      {text:"почему вы должны делиться?", time:60+57.7}

    ],
    []


  ],
  /* Story 2*/
  [
    [
      {text:"Вы никогда не боялись темноты ночью?", time:3.5},
      {text:"Носок хочет рассказать вам,", time:6.4},
      {text:"как он перестал бояться темноты.", time:10}
    ],
    [
      {text:"Вечер наступил, в доме стало темно.", time:14.5},
      {text:"Птицы не поют, они уснули давно.", time:19.6},
      {text:"Соседи все свет в домах выключают,", time:23.4},
      {text:"И ночью они в темноте засыпают.", time:28}
    ],

    [
      {text:"Тик-так, тик-так – Носку пора спать.", time:34.5},
      {text:"Тик-так, тик-так – завтра рано вставать.", time:41},
      {text:"Он ложится в кровать и свет выключает,", time:45.4},
      {text:"Но Носка в темноте страх разбирает.", time:50}
    ],

    [
      {text:"Под одеялом с головой он лежит,", time:54},
      {text:"От страха Носочек очень дрожит.", time:58.5},
      {text:"«Я боюсь засыпать, очень страшно мне.", time:63.4},
      {text:"Не могу находиться один в темноте».", time:68.4}
    ],

    [
      {text:"Носок не любит свет выключать,", time:60+12.4},
      {text:"Ночью дом может страшные звуки издавать.", time:60+18.5},
      {text:"В комнате Носка очень темно,", time:60+23.4},
      {text:"Только луна освещает его.", time:60+27.5}
    ],

    [
      {text:"«Скрип... скрип ...", time:60+30.6},
      {text:"Кто это там на полу?", time:60+33.8},
      {text:"Или кто-то притаился в шкафу?", time:60+36.7},
      {text:"А вдруг кто-то залез под кровать?»,-", time:60+40.4},
      {text:"Страшные мысли не дают Носку спать.", time:60+45.2}
    ],

    [
      {text:"Носку любопытно, что там может скрипеть,", time:60+50.5},
      {text:"Он поднялся с кровати, чтоб посмотреть.", time:60+54.5},
      {text:"Свет он включил и к шкафу подошел,", time:60+59.5},
      {text:"Дверцу открыл – никого не нашел.", time:60+65.8}
    ],
    [
      {text:"Чтобы убедиться, Носок все осмотрел,", time:120+11},
      {text:"В кровать он залез, невредим и цел.", time:120+15.4},
      {text:"«Я рад, что проверил все на себе.", time:120+19.4},
      {text:"Теперь я не буду бояться спать в темноте».", time:120+24}
    ],

    [
      {text:"Теперь, когда Носок слышит звук,", time:120+29.4},
      {text:"С кровати встает и смотрит вокруг.", time:120+33.5},
      {text:"Носку не страшно одному оставаться,", time:120+37.2},
      {text:"Монстру к нему никогда не пробраться.", time:120+42.5}
    ],
    [
      {text:"Теперь вы видите,", time:120+46.2},
      {text:"как можно перестать бояться темноты?", time:120+49.7}
    ],
    [
    ]
  ],

  /* Story 3*/
  [
    [
      {text:"Должны вы быть осторожны там, где играете?", time:3.6},
      {text:"Носок и Ботинки расскажут вам,", time:6.6},
      {text:"почему вы должны быть осторожны.", time:9.6}
    ],
    [
      {text:"В доме много места, где можно поиграть.", time:14.5},
      {text:"Как мышка, можно залезть под кровать.", time:18.2},
      {text:"Носок для игры ищет новое место.", time:22},
      {text:"Дом очень большой, но в нем играть тесно.", time:26.6}
    ],
    [
      {text:"«Давай поиграем в стиральной машине.", time:30.4},
      {text:"Там будем вертеться в порошке или в мыле»,-", time:34.7},
      {text:"Носок предложил внутри покружиться,-", time:38.2},
      {text:"«Тебе будет весело со мной прокатиться».", time:42.6}
    ],
    [
      {text:"Ботинки сказали: «Нам нельзя там кататься!", time:47.4},
      {text:"Ведь может случайно она поломаться.", time:50.8},
      {text:"Давай мы с тобою дом обойдем,", time:53.7},
      {text:"И безопасное место найдем».", time:57.7}
    ],
    [
      {text:"Носок говорит: «Я внутри прокачусь,", time:62.5},
      {text:"А ты стой и смотри, как я веселюсь».", time:66.4},
      {text:"Ботинки сказали: «Носок, погоди!»", time:70.4},
      {text:"Но он уже влез и сидел там внутри.", time:60+15.4}
    ],

    [
      {text:"Машинка закрылась, барабан завращался,", time:60+20},
      {text:"Вода полилась, и Носок испугался.", time:60+24.3},
      {text:"Он вдруг закричал: «Скорей помогите!", time:60+27.7},
      {text:"Стиральную машинку остановите!»", time:60+32.3}
    ],


    [
      {text:"Ботинки забрались к дверце наверх,", time:60+35.5},
      {text:"Ее открыть пытались из сил, изо всех.", time:60+40.5},
      {text:"Но дверь не открылась – она заперта.", time:60+44.7},
      {text:"Как же ботинкам добраться до Носка?", time:60+48.6}
    ],

    [
      {text:"Носок из машинки кричит вдруг ещё:", time:60+52.5},
      {text:"«Есть вилка в розетке – вынь скорее её!»", time:60+56.8},
      {text:"Ботинки розетку не могут найти.", time:120.5},
      {text:"Им нужно скорее Носок спасти.", time:123.6}
    ],
    [
      {text:"«Вот же она!»,- закричали Ботинки.", time:128.4},
      {text:"И из розетки вынули вилку.", time:120+11.2},
      {text:"Стиральная машина остановилась.", time:120+14},
      {text:"Ботинки спасли друга, и все получилось.", time:120+19.8}
    ],
    [
      {text:"Теперь Носок спасен,", time:120+22.9},
      {text:"и сегодня он понял,", time:120+24.9},
      {text:"что должен играть только там,", time:120+28.2},
      {text:"где это безопасно.", time:120+30},
      {text:"Можете ли вы назвать места,", time:120+32.7},
      {text:"в которых небезопасно играть?", time:120+35.4}
    ],
    []
  ]
];