HEADER_TITLE = "قصة كتاب";
TITLES = ["جورب وحذاء – التقاسم", "الخوف من الظلام", "إلعب بشكل آمن"];
PAGE_NUMBERS = [
    [1,2,3,4,5,6,7,8,9],
    [1,2,3,4,5,6,8,9,10,11,12],
    [1,2,3,4,5,6,7,8,9,10,11]
];

BUTTONS = {"help" : "مساعدة", "main_menu" : "القائمة الرئيسية", "story_book" : "قصة كتاب",
    "read_myself" : "قراءة نفسي", "read_to_me" : "قراءة لي", "story_menu" : "قصة القائمة"};

TEXTS = [
    [
        [
            {text:"هل تعلم لماذا ينبغي عليك أن تتقاسم مع الغير؟", time:4.4},

            {text:"يرغب جورب وصديقه العزيز حذاء", time:8.4},
            {text:"في أن يظهرا لك كيف يكون ذلك.", time:13.5}
        ],
        [
            {text:"ذات يوم، خرج جورب وحذاء للعب.", time:17.5},
            {text:"جهزا غدائهما ومضيا في طريقهما.", time:22.4},
            {text:"يقول جورب، \"هيا بنا نلعب في المتنزه.\"", time:27.2},
            {text:"فيقول حذاء، \"فالنرجع إذا قبل أن يحل الظلام.", time:32.4}
        ],
        [
            {text:"بمجرد وصولهما إلى المنتزه،", time:35.7},
            {text:"وضعا غدائهما فوق الطاولة.", time:39.4},
            {text:'يقول جورب "حان الآن وقت المتعة."', time:42.4},
            {text:"فيلعبان لعبة الغميضة، ويضحكون ويركضون.", time:48}
        ],

        [
            {text:"طارت طيور وأكلت غداء جورب.", time:52},
            {text:"الطيور أكلت ثم أكلت، ومضغت ثم مضغت.", time:56},
            {text:"جورب وحذاء سيرجعان فيما بعد.", time: 60},
            {text:"لكن ما عسى جورب أن يفعل؟ لقد اختفى غدائه.", time: 60+6}
        ],
        [
            {text:'"أنا جائع،" يقول حذاء، "هيا بنا نأكل."', time:60+10.4},
            {text:"يعلم حذاء أن في غدائه هدية خاصة.", time:60+15},
            {text:'لقد لعب الإثنان لساعات، والوقت الآن الساعة 12.', time:60+23},
            {text:'"هيا بنا نرجع إلى الطاولة،" يقول جورب وحذاء.', time:60+28}
        ],
        [

            {text:'آه لا! يقول جورب بدهشة شديدة،', time:60+34},
            {text:'إن غدائي قد اختفى، وانفجر جورب بالبكاء', time:60+37},
            {text:'لا تقلق، يقول حذاء، فلدي الكثير من الغداء،', time:60+42},
            {text:'يمكن أن نتقاسم غدائي نحن الإثنان', time:60+45}
        ],
        [
            {text:"جورب سعيد الآن لوجود غداء يأكله.", time:60+50},
            {text:"يتقاسم حذاء حتى كعكة الشوكولاته مع جورب، وهي متعته المفضلة.", time:60+58},
            {text:"والآن حذاء سعيد أيضا.", time:122},
            {text:"لأن تقاسمه الغداء مع جورب جعله سعيدا، والتقاسم شيء جيد فعله.", time:120+18}
        ],
        [
            {text:"الآن هل تدرك لماذا ينبغي عليك التقاسم؟", time:120+20.5}

        ],
        []


    ],
    /* Story 2*/
    [
        [
            {text:"هل تخاف من الظلام في الليل؟", time:3},
            {text:"يرغب جورب في أن يخبرك عن كيفية", time:10},
            {text:"تغلبه على خوفه من الظلام.", time:16.5}
        ],
        [
            {text:"في الساعة 8 يحل الظلام في منزل جورب.", time:20.6},
            {text:"تتوقف الطيور عن التغريد، وتتوقف الكلاب عن النباح.", time:23.8},
            {text:"يطفئ الحي كله الأنوار في منازلهم.", time:28.5},
            {text:"ويذهب كلهم للنوم في الليل. ", time:34}
        ],

        [
            {text:"تيك...توك....تيك...توك", time:40},

            {text:"دقت الساعة الثامنة، وحان وقت نوم جورب. ", time:43.6},
            {text:"إنه سيتجهز للنوم، وسيطفئ الأنوار بعد ذلك،", time:47},
            {text:"لكن جورب خائف من الظلام.", time:52.8}
        ],

        [
            {text:"إنه يسحب غطائه حتى رأسه،", time:56},
            {text:"ويستلقي وهو يرتعد فوق سريره.", time:61.5},
            {text:'"أنا خائف، أنا خائف" يبدأ جورب بالصراخ.', time:65},
            {text:'"أنا لا أحب إطفاء الأنوار."', time:68}
        ],

        [
            {text:"لا يريد جورب إطفاء الانوار،", time:71.5},

            {text:"لأن هناك أصوات مخيفة تصدر من البيت في الليل.", time:60+20},
            {text:"حل الظلام الآن في غرفة جورب، ", time:60+23},
            {text:"والضوء الوحيد هو ضوء القمر الساطع.", time:93}
        ],

        [
            {text:"صرير.... صرير....إنه صوت الأرضية", time:97},
            {text:"هل هذا ضجيج يصدر من باب الخزانة؟", time:98},
            {text:"إن مجرد التفكير في هذا يجعل من جورب مذعورا جدا.", time:99},
            {text:"هل يمكن أن يكون هناك شيء يختبئ في الداخل؟", time:112}
        ],

        [
            {text:"يملؤ الفضول جورب للغاية،", time:117},
            {text:"فيقفز من السرير وذهب ليرى ماذا هناك.", time:123},
            {text:"إنه يفتح باب الخزانة ويضيء الأنوار،", time:126},
            {text:"ولا يجد أثرا لوحش في أي مكان.", time:130}
        ],

        [
            {text:"وليتأكد أكثر، يلتفت جورب يمينا ويسارا،", time:135},
            {text:"ويقفز في سريره مرة أخرى لينام آمنا سليما.", time:140},
            {text:'"أنا سعيد بأنني تأكدت بنفسي،" يقول جورب.', time:147},
            {text:'"لن أخاف بعد الآن عند الساعة 8."', time:153}
        ],

        [
            {text:"كلما خاف جورب من الظلام أثناء الليل", time:160},
            {text:"يتحقق من الغرفة كلها بعد أن يضيء الأنوار", time:164},
            {text:"يمكن لجورب الآن النوم خالي البال،", time:166},
            {text:"لأنه لا توجد وحوش في الغرفة.", time:170}
        ],
        [
            {text:"هل رأيت الآن كيف يمكنك", time:180},
            {text:"التغلب على خوفك من الظلام؟", time:188.5}
        ],
        [
        ]
    ],

    /* Story 3*/
    [
        [
            {text:"هل يجب عليك أن تكون حذرا فيما يتعلق بمكان لعبك؟", time:2.4},

            {text:" يرغب جورب وحذاء في أن يظهرا لك لماذا عليك الحذر.", time:7}
        ],

        [
            {text:"هناك أماكن كثيرة في البيت يمكنك اللعب فيها.", time:11.5},
            {text:"حتى تحت السرير مثل فأر صغير.", time:15.5},
            {text:"يرغب جورب في العثور على مكان يلعب فيه.", time:20.3},
            {text:"ببساطة أين سيلعب ألعابه اليوم؟", time:23.5}
        ],

        [
            {text:"يرغب جورب في اللعب داخل الغسالة.", time:27.2},
            {text:"إنها تدور وتدور وتجعل الأشياء نظيفة.", time:29},
            {text:'يقول جورب لحذاء، "هيا بنا ندخل فيها،', time:32},
            {text:' إنه أمر يبدو ممتعا....يمكننا أن نذهب في رحلة."', time:34.7}
        ],

        [
            {text:'"لا،" يقول حذاء، "لا يمكننا الذهاب في رحلة."', time:43},
            {text:'"فمن الممكن أن نصاب بأذى إذا دخلنا فيها."', time:46.5},
            {text:'"أنا أعتقد أنه ينبغي علينا البحث عن مكان آخر."', time:50},
            {text:'"يجب علينا أن نلعب في مكان نعرف أنه آمن."', time:55}
        ],

        [
            {text:'يقول جورب، "أنا سأدخل فيها لأستمتع كل الإستمتاع،', time:59},
            {text:'ويمكنك المراقبة ببساطة حتى أنتهي."', time:60.7},
            {text:'يبدأ حذاء بالقلق على صديقه.', time:62.5},
            {text:'"لا تفعل ذلك،" يقول حذاء، لكن مع ذلك يمضي جورب متسلقا الغسالة.', time:66}
        ],

        [
            {text:"تنغلق الغسالة، وهي تقعقع وتقعقع.", time:60+15.5},
            {text:"تمتلئ الغسالة بالمياه بينما يتشقلب جورب ويدور.", time:60+20},
            {text:'"ساعدني يا حذاء،" يبدأ جورب في الصراخ،', time:60+23},
            {text:'"الرجاء إخراجي من هذه الغسالة."', time:60+27}
        ],


        [
            {text:"يتسلق حذاء الغسالة ويسحب الباب،", time:60+31},
            {text:"إنه يحاول ويحاول ويحاول.", time:60+34},
            {text:"إن الباب لا ينفتح لأنه مغلق،", time:60+38},
            {text:"فكيف يمكن لحذاء الوصول إلى المسكين جورب الصغير؟", time:60+43}
        ],

        [
            {text:"يُصدر جورب صرخة أخرى،", time:60+45.4},
            {text:'أرجوك إسحب سلك الكهرباء من الغسالة!', time:60+50},
            {text:'فكرة رائعة! يقول حذاء، ولكن أين السلك؟', time:60+54.5},
            {text:"إنه يبحث عنه في كل مكان حتي تحت السجاد.", time:60+58.5}
        ],
        [
            {text:'إنه هناك! يصرخ حذاء.', time:121.6},
            {text:"إنه يجري نحو الجدار ويسحب القابس.", time:125},
            {text:"تتوقف الغسالة وينفتح الباب.", time:129.5},
            {text:"لقد أنقذ حذاء صديقه المفضل جورب.", time:120+14}
        ],
        [

            {text:"جورب في مأمن الآن، وقد تعلم اليوم", time:120+16.5},
            {text:"أنه ينبغي أن يلعب فقط في مكان يعرف أنه آمن اللعب فيه.", time:120+20},
            {text:"هل بإمكانك أن تفكر في أمكان غير آمنة للعب فيها؟", time:180}
        ],
        [
        ]
    ]
];