HEADER_TITLE = "故事書";
TITLES = ["袜子和靴子--分享", "怕黑", "安全第一"];
PAGE_NUMBERS = [
    [1,2,3,4,5,6,7,8,9],
    [1,2,3,4,5,6,8,9,10,11,12],
    [1,2,3,4,5,6,7,8,9,10,11]
];

BUTTONS = {"help" : "幫助", "main_menu" : "主菜單", "story_book" : "故事書",
    "read_myself" : "讀自己", "read_to_me" : "我讀過", "story_menu" : "故事菜單"};

TEXTS = [
    [
        [
            {text:"你知道为什么你应该分享吗？", time:2.5},
            {text:"袜子和他最好的朋友靴子想告诉你。", time:7}
        ],
        [
            {text:"一天袜子和靴子一起出去玩。", time:11.4},
            {text:"他们打包午饭上路了。", time:14.7},
            {text:"袜子说“我们去公园玩。”", time:18},
            {text:"靴子说“天黑前我们就回来。”", time:23}
        ],

        [
            {text:"当他们到达公园。", time:25},
            {text:"他们把午餐放到桌子上。", time:27.4},
            {text:"袜子说“好玩的时间到了。”", time:31.4},
            {text:"他们玩捉迷藏，笑着跑着。", time:36.2}
        ],

        [
            {text:"鸟儿飞来吃掉袜子的午餐。", time:39},
            {text:"他们吃啊吃啊越吃越多", time:43.5},
            {text:"袜子和靴子之后将会回来。", time:46},
            {text:"但袜子将会怎么做呢？他的午餐没了。", time:49}

        ],
        [
            {text:"靴子说“我饿了”，“我们去吃饭吧。”", time:52.4},
            {text:"靴子知道他的午餐有特别的东西。", time:56},
            {text:"他们已经玩耍了好多小时，现在是12点了。", time:59},
            {text:"靴子对袜子说“让我们回到桌子那去”。", time:65}
        ],
        [

            {text:"哦！不！袜子很吃惊地说，", time:69},
            {text:"我的午餐不见了，他开始大哭，", time:72},
            {text:"靴子说，别担心，我有午餐，", time:76},
            {text:"我们可以一起分享我的午餐。", time:82}

        ],
        [

            {text:"袜子现在开心了有午餐可以吃。", time:85},
            {text:"靴子甚至分享了他的巧克力蛋糕，他最喜欢的东西。", time:88.5},
            {text:"现在靴子也非常开心。", time:90.4},
            {text:"因为分享令袜子开心，分享也是好事。", time:100.4}
        ],
        [
            {text:"现在你明白为什么你应该分享了吗？", time:107.8}

        ],
        []


    ],
    /* Story 2*/
    [
        [
            {text:"你曾夜晚怕黑吗？", time:5},
            {text:"袜子想告诉你他是如何克服对黑暗的恐惧的。", time:12.5}
        ],
        [
            {text:"在8点整，袜子的屋子变黑了。", time:16.8},
            {text:"鸟儿不歌唱，狗狗不叫唤。", time:20.7},
            {text:"左邻右舍关了灯，", time:24.6},
            {text:"他们都在夜晚睡觉了。", time:27.5}
        ],

        [
            {text:"嘀嗒嘀嗒", time:30.5},
            {text:"钟表敲响8，是袜子的睡觉时间了。", time:36.2}
        ],

        [
            {text:"他将准备睡觉了，然后他将熄灯，", time:41},
            {text:"但袜子夜晚怕黑。", time:44}
        ],

        [
            {text:"他把被子拉过头顶，", time:47.8},
            {text:"躺在床上发抖。", time:51.8},
            {text:"“我很怕，我很怕”袜子开始大喊", time:56},
            {text:"“我不喜欢关灯。”", time:59.5}
        ],

        [
            {text:"袜子不喜欢关灯，", time:60+2.4},
            {text:"因为房子在夜晚发出可怕的噪音。", time:60+6.7},
            {text:"现在袜子的房间变暗了", time:60+13.5},
            {text:"除了熠熠的月光。", time:60+20.5}
        ],

        [
            {text:"地板吱吱……吱吱……地响。", time:60+22},

            {text:"是从壁橱门那里发出的噪音吗？", time:60+26},
            {text:"这种想法让袜子很害怕。", time:60+32},
            {text:"是什么东西藏在那里吗？", time:60+37}
        ],

        [
            {text:"袜子好奇是什么，", time:60+40},
            {text:"他跳下床去看个究竟。", time:60+43},
            {text:"他打开壁橱打开灯，", time:60+47},
            {text:"看不到有妖怪。", time:60+52}
        ],

        [
            {text:"为以防万一，袜子环顾四周，", time:60+56},
            {text:"然后他跳回床上安全美美地睡觉。", time:123},
            {text:"袜子说“我很高兴为自己检查了”，", time:128},
            {text:"““现在8点我不害怕了。”", time:120+11}
        ],

        [
            {text:"当袜子夜晚怕黑的时候", time:120+19},
            {text:"当他打开灯的时候，他就查看整个房间", time:120+28},
            {text:"现在袜子可以放心睡觉了，", time:120+30},
            {text:"因为那里没有妖怪。", time:120+35}
        ],
        [
            {text:"现在你明白你如何能克服怕黑了吗？", time:120+42}
        ],
        [
        ]
    ],

    /* Story 3*/
    [
        [
            {text:"你玩耍的时候应该当心吗？", time:3},

            {text:"袜子和靴子想告诉你为什么你应该当心", time:7.6}
        ],

        [
            {text:"房子里有很多地方可以玩耍。", time:11.4},

            {text:"甚至像小老鼠一样在床下。", time:14.7},
            {text:"袜子想寻找新地方玩耍。", time:17.6},
            {text:"今天他能在哪里玩游戏呢？", time:20.6}
        ],

        [
            {text:"袜子想在洗衣机里玩。", time:23.8},

            {text:"洗衣机转啊转啊洗东西。", time:25.7},
            {text:"袜子对靴子说“让我们进去吧，", time:28},
            {text:"看起来有趣……我们可以去兜风。”", time:31.5}
        ],

        [
            {text:"靴子说“不”，“我们不能去兜风”", time:37},
            {text:"“我们在里面可能会受伤。”", time:41},
            {text:"“我想我们应该找别的地方。”", time:44},
            {text:"“我们应该在我们知道安全的地方玩耍。”", time:47}
        ],

        [
            {text:"袜子说“我要进去玩个痛快", time:50},
            {text:"你就光看吧。”", time:53.5},
            {text:"“靴子开始发愁他的朋友了。", time:55},
            {text:"”靴子说“不要啊”，但是袜子还是爬进去。", time:64}
        ],

        [
            {text:"洗衣机锁起来了，隆隆响。", time:69},
            {text:"当洗衣机加进了水，袜子不住翻滚。", time:60+13},
            {text:"袜子尖叫“救我，靴子”，", time:60+17},
            {text:"“请帮我从这洗衣机里出去。”", time:96}
        ],


        [
            {text:"靴子爬的很高，拉门，", time:99},
            {text:"他试啊试啊，继续试。", time:101.5},
            {text:"门开不开，因为它锁住了，", time:106},
            {text:"所以靴子如何能救可怜的袜子呢？", time:108}
        ],

        [
            {text:"袜子发出又一声尖叫，", time:110},
            {text:"请拔出洗衣机插头", time:115},
            {text:"是的！靴子说，但是插头在哪？", time:118},
            {text:"他环顾四周甚至地毯下面。", time:120}
        ],
        [
            {text:"在那！靴子大喊。", time:123},
            {text:"他跑到墙那，猛拔插头出来。", time:126},
            {text:"洗衣机停下来，门解锁。", time:130},
            {text:"靴子解救了他最好的朋友袜子。", time:134}
        ],
        [

            {text:"现在袜子安全了，他今天学到了，", time:138},
            {text:"他应该在他知道安全的地方玩耍。", time:144},
            {text:"你能想出不安全的玩的地方吗？", time:149.1}

        ],
        [
        ]
    ]
];
